Revit 2027 API
ParameterTypeId.MepHeatingCoilType Property
 "Heating Coil"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepHeatingCoilType { get; }
Public Shared ReadOnly Property MepHeatingCoilType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepHeatingCoilType {
	ForgeTypeId^ get ();
}
static member MepHeatingCoilType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace